app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Event"], ["created_at", "2015-05-23 00:27:07.735351"], ["updated_at", "2015-05-23 00:27:07.735351"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @category = Category.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Events"], ["updated_at", "2015-05-23 00:34:49.286376"], ["id", 2]]
---
  def update
    @category = Category.find(params[:id])

    if @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy

SELECT "categories".* FROM "categories" WHERE (name like '%news%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @categories = Category.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])