app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "category_id", "user_id", "tags", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "rollins.jpg"], ["image_file_size", 64659], ["image_updated_at", "2015-05-25 20:13:17.120801"], ["updated_at", "2015-05-25 20:13:17.135811"], ["id", 5]]

  def index
    if params[:search]
      @posts = Post.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT "posts".* FROM "posts" WHERE (title like '%three%' OR body like '%three%')  ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts"