app/controllers/admin/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Chris"], ["email", "chriswbastian@gmail.com"], ["created_at", "2015-05-23 22:52:48.532698"], ["updated_at", "2015-05-23 22:52:48.532698"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE (name like '%chris%' OR email like '%chris%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @users = User.search(params[:search]).all.order('created_at DESC').paginate(:per_page => 10, :page => params[:page])