app/views/partials/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
  <div class="comments">
    <h2 class="page-header"><%= @post.comments.length %> Comments</h2>