app/views/admin/posts/edit.html.erb

    <%= f.label :category %>
    <%= f.select :category_id, Category.all.collect { |cat| [cat.name, cat.id] }, { :include_blank => 'Select One' }, class:'form-control' %>
---
SELECT "categories".* FROM "categories"

    <%= f.label :author %>
    <%= f.select :user_id, User.all.collect { |aut| [aut.name, aut.id] }, { :include_blank => 'Select One' }, class:'form-control' %>
---
SELECT "users".* FROM "users"