app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("name", "email", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "bob smith"], ["email", "bob@bob.com"], ["body", "hey what is up"], ["post_id", 2], ["created_at", "2015-05-28 06:31:16.985353"], ["updated_at", "2015-05-28 06:31:16.985353"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)