app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE (title like '%Vivamus%' OR body like '%Vivamus%')  ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    if params[:search]
      @posts = Post.search(params[:search]).order('created_at DESC').paginate(:per_page => 10, :page => params[:page])