app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @categories = Category.all
---
SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories"

  def show
    @post = Post.find(params[:id])
    @categories = Category.all
    @comment = Comment.new
    @comments = Comment.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
SELECT "categories".* FROM "categories"
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]